酒店ip，自己拿去套
#百纳瑞汀山东
CCTV-1,http://221.0.78.26:881/hls/50201/index.m3u8
广东湛江吴川
CCTV-1高清,http://113.101.119.104:808/hls/113/index.m3u8
                    http://113.101.119.104:8090/hls/113/index.m3u8
广东珠江高清,http://113.101.119.104:8090/hls/105/index.m3u8
#信阳豫港酒店
CCTV-1综合,http://36.99.128.111:808/hls/1/index.m3u8
#江西抚州
CCTV 1,http://fzcds.cn:899/hls/1/index.m3u8
#某某瑞庭酒店
CCTV 1,http://117.158.112.72:9877/hls/1/index.m3u8

💝沈阳联通,#genre#
CCTV1,http://39.134.52.215/PLTV/88888888/224/3221226443/index.m3u8
CCTV2,http://39.134.52.215/PLTV/88888888/224/3221226843/index.m3u8
CCTV3,http://39.134.52.215/PLTV/88888888/224/3221226898/index.m3u8
CCTV4,http://39.134.52.215/PLTV/88888888/224/3221226845/index.m3u8
CCTV5,http://39.134.52.215/PLTV/88888888/224/3221226900/index.m3u8
CCTV6,http://39.134.52.215/PLTV/88888888/224/3221226847/index.m3u8
CCTV7,http://39.134.52.215:80/PLTV/88888888/224/3221226640/index.m3u8
CCTV8,http://39.134.52.215/PLTV/88888888/224/3221226902/index.m3u8
CCTV9,http://39.134.52.215/PLTV/88888888/224/3221226849/index.m3u8
CCTV10,http://39.134.52.215/PLTV/88888888/224/3221226462/index.m3u8
CCTV11,http://39.134.52.215/PLTV/88888888/224/3221226851/index.m3u8
CCTV12,http://39.134.52.215/PLTV/88888888/224/3221226439/index.m3u8
CCTV13,http://39.134.52.215/PLTV/88888888/224/3221226853/index.m3u8
CCTV14,http://39.134.52.215/PLTV/88888888/224/3221226464/index.m3u8
CCTV15,http://39.134.52.215/PLTV/88888888/224/3221226855/index.m3u8
CCTV16,http://39.134.52.214/PLTV/88888888/224/3221226834/index.m3u8
CCTV17,http://39.134.52.215/PLTV/88888888/224/3221226594/index.m3u8
CCTV5+,http://39.134.52.215/PLTV/88888888/224/3221226445/index.m3u8
辽宁卫视,http://39.134.52.215/PLTV/88888888/224/3221226461/index.m3u8
辽宁都市,http://39.134.52.214/PLTV/88888888/224/3221226914/index.m3u8
辽宁体育,http://39.134.52.214/PLTV/88888888/224/3221226916/index.m3u8
辽宁影视,http://39.134.52.214/PLTV/88888888/224/3221226861/index.m3u8
辽宁经济,http://39.134.52.214/PLTV/88888888/224/3221226869/index.m3u8
辽宁北方,http://39.134.52.214/PLTV/88888888/224/3221226865/index.m3u8
辽宁生活,http://39.134.52.214/PLTV/88888888/224/3221226918/index.m3u8
辽宁青少,http://39.134.52.214/PLTV/88888888/224/3221226863/index.m3u8
辽宁公共,http://39.134.52.214/PLTV/88888888/224/3221226922/index.m3u8
辽宁移动,http://39.134.52.214/PLTV/88888888/224/3221226867/index.m3u8
家庭理财,http://39.134.52.214/PLTV/88888888/224/3221226538/index.m3u8
沈阳新闻综合,http://39.134.52.214/PLTV/88888888/224/3221226593/index.m3u8
新动漫,http://39.134.52.214:80/PLTV/88888888/224/3221226501/index.m3u8
金鹰纪实,http://39.134.52.215/PLTV/88888888/224/3221226459/index.m3u8
金鹰卡通,http://39.134.52.215/PLTV/88888888/224/3221226543/index.m3u8
北京纪实科教,http://39.134.52.215/PLTV/88888888/224/3221226472/index.m3u8
北京kaku少儿,http://39.134.52.215:80/PLTV/88888888/224/3221226833/index.m3u8
北京卫视,http://39.134.52.215/PLTV/88888888/224/3221226449/index.m3u8
东方卫视,http://39.134.52.215/PLTV/88888888/224/3221226453/index.m3u8
江苏卫视,http://39.134.52.215/PLTV/88888888/224/3221226638/index.m3u8
浙江卫视,http://39.134.52.215/PLTV/88888888/224/3221226618/index.m3u8
湖南卫视,http://39.134.52.215/PLTV/88888888/224/3221226480/index.m3u8
黑龙江卫视,http://39.134.52.215/PLTV/88888888/224/3221226478/index.m3u8
深圳卫视,http://39.134.52.215/PLTV/88888888/224/3221226463/index.m3u8
天津卫视,http://39.134.52.215/PLTV/88888888/224/3221226465/index.m3u8
广东卫视,http://39.134.52.215/PLTV/88888888/224/3221226476/index.m3u8
山东卫视,http://39.134.52.215/PLTV/88888888/224/3221226486/index.m3u8
安徽卫视,http://39.134.52.215/PLTV/88888888/224/3221226447/index.m3u8
四川卫视,http://39.134.52.215/PLTV/88888888/224/3221226488/index.m3u8
东南卫视,http://39.134.52.215/PLTV/88888888/224/3221226536/index.m3u8
贵州卫视,http://39.134.52.215/PLTV/88888888/224/3221226616/index.m3u8
吉林卫视,http://39.134.52.215/PLTV/88888888/224/3221226763/index.m3u8
江西卫视,http://39.134.52.215/PLTV/88888888/224/3221226516/index.m3u8
河北卫视,http://39.134.52.215/PLTV/88888888/224/3221226576/index.m3u8
湖北卫视,http://39.134.52.215/PLTV/88888888/224/3221226455/index.m3u8
重庆卫视,http://39.134.52.215/PLTV/88888888/224/3221226490/index.m3u8
河南卫视,http://39.134.52.215/PLTV/88888888/224/3221226491/index.m3u8
海南卫视,http://39.134.52.215/PLTV/88888888/224/3221226585/index.m3u8
山西卫视,http://39.134.52.215/PLTV/88888888/224/3221226475/index.m3u8
广西卫视,http://39.134.52.215/PLTV/88888888/224/3221226580/index.m3u8
云南卫视,http://39.134.52.215/PLTV/88888888/224/3221226634/index.m3u8
兵团卫视,http://39.134.52.215/PLTV/88888888/224/3221226602/index.m3u8
甘肃卫视,http://39.134.52.215/PLTV/88888888/224/3221226612/index.m3u8
宁夏卫视,http://39.134.52.215/PLTV/88888888/224/3221226587/index.m3u8
新疆卫视,http://39.134.52.215/PLTV/88888888/224/3221226601/index.m3u8
西藏卫视,http://39.134.52.215/PLTV/88888888/224/3221226630/index.m3u8
内蒙古卫视,http://39.134.52.215/PLTV/88888888/224/3221226626/index.m3u8
陕西卫视,http://39.134.52.215/PLTV/88888888/224/3221226591/index.m3u8
青海卫视,http://39.134.52.215/PLTV/88888888/224/3221226628/index.m3u8
延边卫视,http://39.134.52.215/PLTV/88888888/224/3221226767/index.m3u8
厦门卫视,http://39.134.52.215/PLTV/88888888/224/3221226529/index.m3u8
农林卫视,http://39.134.52.215/PLTV/88888888/224/3221226818/index.m3u8
康巴卫视,http://39.134.52.215:80/PLTV/88888888/224/3221226822/index.m3u8
安多卫视,http://39.134.52.215:80/PLTV/88888888/224/3221226769/index.m3u8
CETV1,http://39.134.52.215/PLTV/88888888/224/3221226518/index.m3u8
嘉佳卡通,http://39.134.52.215/PLTV/88888888/224/3221226514/index.m3u8
优漫卡通,http://39.134.52.215/PLTV/88888888/224/3221226548/1.m3u8
山东教育,http://39.134.52.215/PLTV/88888888/224/3221226816/index.m3u8
咪咕1,http://39.134.52.215/PLTV/88888888/224/3221226899/index.m3u8
咪咕2,http://39.134.52.214/PLTV/88888888/224/3221226901/index.m3u8
咪咕3,http://39.134.52.214/PLTV/88888888/224/3221226956/index.m3u8
咪咕4,http://39.134.52.215/PLTV/88888888/224/3221227029/index.m3u8
咪咕5,http://39.134.52.215/PLTV/88888888/224/3221227055/index.m3u8
咪咕6,http://39.134.52.215/PLTV/88888888/224/3221227059/index.m3u8
咪咕7,http://39.134.52.215/PLTV/88888888/224/3221227098/index.m3u8
咪咕8,http://39.134.52.215/PLTV/88888888/224/3221227100/index.m3u8
咪咕9,http://39.134.52.215/PLTV/88888888/224/3221227102/index.m3u8
咪咕10,http://39.134.52.215/PLTV/88888888/224/3221227104/index.m3u8
咪咕11,http://39.134.52.215/PLTV/88888888/224/3221227106/index.m3u8
咪咕12,http://39.134.52.215/PLTV/88888888/224/3221227108/index.m3u8
咪咕13,http://39.134.52.215/PLTV/88888888/224/3221227110/index.m3u8
咪咕14,http://39.134.52.215/PLTV/88888888/224/3221227112/index.m3u8
咪咕15,http://39.134.52.215/PLTV/88888888/224/3221227114/index.m3u8
咪咕16,http://39.134.52.215/PLTV/88888888/224/3221227116/index.m3u8
咪咕17,http://39.134.52.215/PLTV/88888888/224/3221227118/index.m3u8
咪咕18,http://39.134.52.215/PLTV/88888888/224/3221227120/index.m3u8
咪咕19,http://39.134.52.215/PLTV/88888888/224/3221227122/index.m3u8
咪咕20,http://39.134.52.215/PLTV/88888888/224/3221227124/index.m3u8


央视,#genre#
CCTV1,https://node1.olelive.com:6443/live/CCTV1HD/hls.m3u8
CCTV2,https://node1.olelive.com:6443/live/CCTV2HD/hls.m3u8
CCTV3,https://node1.olelive.com:6443/live/CCTV3HD/hls.m3u8
CCTV4,https://node1.olelive.com:6443/live/CCTV4HD/hls.m3u8
CCTV5,https://node1.olelive.com:6443/live/CCTV5HD/hls.m3u8
CCTV6,https://node1.olelive.com:6443/live/CCTV6HD/hls.m3u8
CCTV7,https://node1.olelive.com:6443/live/CCTV7HD/hls.m3u8
CCTV8,https://node1.olelive.com:6443/live/CCTV8HD/hls.m3u8
CCTV9,https://node1.olelive.com:6443/live/CCTV9HD/hls.m3u8
CCTV10,https://node1.olelive.com:6443/live/CCTV10HD/hls.m3u8
CCTV11,https://node1.olelive.com:6443/live/CCTV11HD/hls.m3u8
CCTV12,https://node1.olelive.com:6443/live/CCTV12HD/hls.m3u8
CCTV13,https://node1.olelive.com:6443/live/CCTV13HD/hls.m3u8
CCTV14,https://node1.olelive.com:6443/live/CCTV14HD/hls.m3u8
CCTV15,https://node1.olelive.com:6443/live/CCTV15HD/hls.m3u8
CCTV16,https://node1.olelive.com:6443/live/CCTV16HD/hls.m3u8
CCTV17,https://node1.olelive.com:6443/live/CCTV17HD/hls.m3u8
CCTV5+,https://node1.olelive.com:6443/live/CCTV5PHD/hls.m3u8

CCTV1 (综合) ,https://node1.olelive.com:6443/live/CCTV1HD/hls.m3u8
CCTV2 (财经) ,https://node1.olelive.com:6443/live/CCTV2HD/hls.m3u8
CCTV3 (综艺) ,https://node1.olelive.com:6443/live/CCTV3HD/hls.m3u8
CCTV4 (亚洲) ,https://node1.olelive.com:6443/live/CCTV4HD/hls.m3u8
CCTV5 (体育) ,https://node1.olelive.com:6443/live/CCTV5HD/hls.m3u8
CCTV6 (电影) ,https://node1.olelive.com:6443/live/CCTV6HD/hls.m3u8
CCTV7 (军事) ,https://node1.olelive.com:6443/live/CCTV7HD/hls.m3u8
CCTV8 (电视剧) ,https://node1.olelive.com:6443/live/CCTV8HD/hls.m3u8
CCTV9 (记录) ,https://node1.olelive.com:6443/live/CCTV9HD/hls.m3u8
CCTV10 (科教) ,https://node1.olelive.com:6443/live/CCTV10HD/hls.m3u8
CCTV11 (戏曲) ,https://node1.olelive.com:6443/live/CCTV11HD/hls.m3u8
CCTV12 (社会与法) ,https://node1.olelive.com:6443/live/CCTV12HD/hls.m3u8
CCTV13 (新闻) ,https://node1.olelive.com:6443/live/CCTV13HD/hls.m3u8
CCTV14 (少儿) ,https://node1.olelive.com:6443/live/CCTV14HD/hls.m3u8
CCTV15 (音乐) ,https://node1.olelive.com:6443/live/CCTV15HD/hls.m3u8
CCTV5+ (体育赛事) ,https://node1.olelive.com:6443/live/CCTV5PHD/hls.m3u8
CCTV16 (奥林匹克) ,https://node1.olelive.com:6443/live/CCTV16HD/hls.m3u8
CCTV17 (农业农村) ,https://node1.olelive.com:6443/live/CCTV17HD/hls.m3u8

电视剧,#genre#
雪中悍刀行,http://159.75.85.63:35455/huya/11336592
将夜,http://159.75.85.63:35455/huya/11352885
镖行天下,http://159.75.85.63:35455/huya/11352969
铁齿铜牙纪晓岚,http://159.75.85.63:35455/huya/11342396
庆余年,http://159.75.85.63:35455/huya/11352960
爱情公寓,http://159.75.85.63:35455/huya/11336726
雍正王朝,http://159.75.85.63:35455/huya/11342439
新三国,http://159.75.85.63:35455/huya/11352944
士兵突击,http://159.75.85.63:35455/huya/11342430
邻里一家亲,http://159.75.85.63:35455/huya/11342426
家有儿女,http://159.75.85.63:35455/huya/11352872
父母爱情,http://159.75.85.63:35455/huya/11602071
地下交通站,http://159.75.85.63:35455/huya/11342433
新水浒传,http://159.75.85.63:35455/huya/11342384
阳光的快乐生活,http://159.75.85.63:35455/huya/11602085
龙门客栈,http://159.75.85.63:35455/huya/11352874
六子哥,http://159.75.85.63:35455/huya/11602086
大秦帝国,http://159.75.85.63:35455/huya/11352881
康熙王朝,http://159.75.85.63:35455/huya/11352940
老三国,http://159.75.85.63:35455/huya/11602081
康熙微服私访记,http://159.75.85.63:35455/huya/11342418
神探狄仁杰,http://159.75.85.63:35455/huya/11342425
狄仁杰,http://159.75.85.63:35455/huya/11342958
鬼吹灯,http://159.75.85.63:35455/huya/11352871
民兵葛二蛋,http://159.75.85.63:35455/huya/11602072
倚天屠龙记,http://159.75.85.63:35455/huya/11342403
芈月传,http://159.75.85.63:35455/huya/11352965
一代枭雄,http://159.75.85.63:35455/huya/11342398
神医喜来乐,http://159.75.85.63:35455/huya/11601978
新神雕侠侣,http://159.75.85.63:35455/huya/11352964
炊事班的故事,http://159.75.85.63:35455/huya/19524135
好先生,http://159.75.85.63:35455/huya/11602088
白鹿原,http://159.75.85.63:35455/huya/11342416
我的团长我的团,http://159.75.85.63:35455/huya/11352910
医馆笑传,http://159.75.85.63:35455/huya/11352891
终极三国,http://159.75.85.63:35455/huya/21059562
抗日游击队,http://159.75.85.63:35455/huya/11352936
宝莲灯,http://159.75.85.63:35455/huya/21059563
你是我的荣耀,http://159.75.85.63:35455/huya/11352920
金庸经典剧,http://159.75.85.63:35455/huya/11602082
活佛济公,http://159.75.85.63:35455/huya/11342400
铁梨花,http://159.75.85.63:35455/huya/11352912
娇妹直播间,http://159.75.85.63:35455/huya/11342404
钢铁战队,http://159.75.85.63:35455/huya/11336578
武侠剧,http://159.75.85.63:35455/huya/11352952
新中华小当家,http://159.75.85.63:35455/huya/24257300
吕不韦传奇,http://159.75.85.63:35455/huya/11352953
狼毒花,http://159.75.85.63:35455/huya/11602042
极限挑战,http://159.75.85.63:35455/huya/11352914
海妖的呼唤,http://159.75.85.63:35455/huya/11602075
封神榜,http://159.75.85.63:35455/huya/23749096
孙悟空,http://159.75.85.63:35455/huya/23735126
楚汉骄雄,http://159.75.85.63:35455/huya/23740156
张卫健西游记,http://159.75.85.63:35455/huya/23728660
鹿鼎记,http://159.75.85.63:35455/huya/23865080
天龙八部,http://159.75.85.63:35455/huya/23903123
刑事侦缉档案,http://159.75.85.63:35455/huya/23734169
法证先锋,http://159.75.85.63:35455/huya/23863804
寻秦记,http://159.75.85.63:35455/huya/23864973
倚天屠龙记,http://159.75.85.63:35455/huya/23734246
洗冤录,http://159.75.85.63:35455/huya/23903130
陀枪师姐,http://159.75.85.63:35455/huya/23860039
神雕侠侣,http://159.75.85.63:35455/huya/23865171
笑傲江湖,http://159.75.85.63:35455/huya/23865142
鉴证实录,http://159.75.85.63:35455/huya/23903183
使徒行者,http://159.75.85.63:35455/huya/23734256
扫黄先锋,http://159.75.85.63:35455/huya/23903196
金枝欲孽,http://159.75.85.63:35455/huya/23865036
创世纪,http://159.75.85.63:35455/huya/23749083
笑看风云,http://159.75.85.63:35455/huya/23865058
妙手仁心,http://159.75.85.63:35455/huya/23829543
大唐双龙传,http://159.75.85.63:35455/huya/23728674
大时代,http://159.75.85.63:35455/huya/23865161
野蛮奶奶大战戈师奶,http://159.75.85.63:35455/huya/23863796
射雕英雄传,http://159.75.85.63:35455/huya/23824164
梁朝伟鹿鼎记,http://159.75.85.63:35455/huya/23734183


剧集_雪中悍刀行,http://159.75.85.63:35455/huya/11336592
剧集_雪中悍刀行,https://epg.112114.xyz/huya/11336592
剧集_雪中悍刀行,https://yang-1989.eu.org/live/huya/11336592
剧集_纪晓岚,http://159.75.85.63:35455/huya/11342396
剧集_庆余年,http://159.75.85.63:35455/huya/11352960
剧集_雍正王朝,http://159.75.85.63:35455/huya/11342439
剧集_士兵突击,http://159.75.85.63:35455/huya/11342430
剧集_爱情公寓,http://159.75.85.63:35455/huya/11336726
剧集_家有儿女,http://159.75.85.63:35455/huya/11352872
剧集_地下交通站,http://159.75.85.63:35455/huya/11342433

金庸武侠,http://159.75.85.63:35455/huya/11342427
神雕侠侣,http://159.75.85.63:35455/huya/23865171
神雕侠侣陈妍希,http://159.75.85.63:35455/huya/11352964
射雕英雄传,http://159.75.85.63:35455/huya/23728674
倚天屠龙记,http://159.75.85.63:35455/huya/11342403
鹿鼎记,http://159.75.85.63:35455/huya/23865080
新三国演义,http://159.75.85.63:35455/huya/11352944
新水浒传,http://159.75.85.63:35455/huya/11342384
三国演义,http://159.75.85.63:35455/huya/11602081
TVB西游记,http://159.75.85.63:35455/huya/23735126
寻秦记,http://159.75.85.63:35455/huya/23864973
天龙八部,http://159.75.85.63:35455/huya/23903123
笑傲江湖,http://159.75.85.63:35455/huya/23865142
新流星蝴蝶剑,http://159.75.85.63:35455/huya/11342420
秦王李世明,http://159.75.85.63:35455/huya/11336572
十大奇冤,http://159.75.85.63:35455/huya/11352899
金装四大才子,http://159.75.85.63:35455/huya/23903183
状王宋世杰,http://159.75.85.63:35455/huya/23734183
布衣神相,http://159.75.85.63:35455/huya/23865036
封神榜,http://159.75.85.63:35455/huya/23749096
宝莲灯,http://159.75.85.63:35455/huya/21059563
秀才遇到兵,http://159.75.85.63:35455/huya/23746486
将夜,http://159.75.85.63:35455/huya/11352885
活佛济公,http://159.75.85.63:35455/huya/11342400
快意江湖,http://159.75.85.63:35455/huya/11342435
镖行天下,http://159.75.85.63:35455/huya/11352969
鬼吹灯,http://159.75.85.63:35455/huya/11352871
大秦帝国,http://159.75.85.63:35455/huya/11352881
楚汉骄雄,http://159.75.85.63:35455/huya/23740156
铁齿铜牙纪晓岚,http://159.75.85.63:35455/huya/11342396
神医喜来乐,http://159.75.85.63:35455/huya/11601978
芈月传,http://159.75.85.63:35455/huya/11352975
爱情公寓,http://159.75.85.63:35455/huya/11336726
雍正王朝,http://159.75.85.63:35455/huya/11342439
神探狄仁杰,http://159.75.85.63:35455/huya/11342425
洗冤录,http://159.75.85.63:35455/huya/23903130
医馆笑传,http://159.75.85.63:35455/huya/11352891
第八号当铺,http://159.75.85.63:35455/huya/21059568
